tap "hashicorp/tap"
tap "microsoft/git"

brew 'git'
brew 'gh'
brew 'git-flow'
brew 'docker'
brew 'docker-compose'
brew 'minikube'
brew 'kubectl'
brew 'helm'
brew 'nvm'
brew 'dvm'
brew 'mysql-client'
brew 'terraform'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'mas'

cask 'google-chrome'
cask 'notion'
cask 'slack'
cask 'adguard'
cask 'chatgpt'
cask 'warp'
cask 'karabiner-elements'
cask 'git-credential-manager-core'
cask 'postman'
cask 'altair-graphql-client'
cask 'visual-studio-code'
cask 'intellij-idea'
cask 'datagrip'
cask 'shottr'
cask 'openlens'

mas 'Magnet', id: 441258766
mas 'aladin ebook ', id: 1023251042
mas 'KakaoTalk', id: 869223134
mas 'Numbers', id: 409203825

vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "vscodevim.vim"
