brew 'git'
brew 'gh'
brew 'git-flow'
brew 'docker'
brew 'docker-compose'
brew 'minikube'
brew 'nvm'
brew 'mongosh'
brew 'mysql-client'
brew 'redis'
brew 'mas'

cask 'google-chrome'
cask 'notion'
cask 'alfred'
cask 'adguard'
cask 'iterm2'
cask 'karabiner-elements'
cask 'git-credential-manager-core'
cask 'sourcetree'
cask 'postman'
cask 'altair-graphql-client'
cask 'visual-studio-code'
cask 'webstorm'
cask 'datagrip'

mas 'Slack', id: 803453959
mas 'Magnet', id: 441258766
mas 'aladin ebook ', id: 1023251042
mas 'KakaoTalk', id: 869223134
mas 'Numbers', id: 409203825
